[
    {
        "title": "The M4 Mac Mini is Incredible!",
        "description": "The video explores the new Mac mini, highlighting its incredibly small size, powerful performance, and surprisingly affordable base model. The reviewer also discusses the potential for the Mac mini to be a portable workstation, thanks to its powerful M4 Pro chip and compact design.",
        "youTubeVideoId": "z19HM7ANZlo",
        "duration": "00:11:44",
        "datePublished": "2024-11-07",
        "category": "Science & Technology"
    },
    {
        "title": "2025 Tesla Model X: The Most Insane Family SUV Money can Buy",
        "description": "Discover the groundbreaking 2025 Tesla Model X as we take you on a comprehensive review of this electrifying SUV. From its mind-bending 1,020 horsepower Plaid variant to its distinctive falcon-wing doors, we explore what makes this electric family hauler unique in today's luxury market. We dive deep into its impressive 335-mile range, cutting-edge technology, controversial steering yoke, and real-world performance capabilities. Whether you are curious about Tesla's Autopilot features, interior quality, or how it stacks up against competitors like the BMW iX and Rivian R1S, this review covers everything you need to know before making your decision. With prices starting at $81,630, find out if this revolutionary electric SUV's blend of space-age technology and supercar performance is worth your investment. Join us as we analyze the pros and cons of Tesla's flagship SUV and determine if it lives up to its ambitious promises.",
        "youTubeVideoId": "OXxhleuQ--4",
        "duration": "00:04:13",
        "datePublished": "2024-11-13",
        "category": "Autos & Vehicles"
    },
    {
        "title": "NASA Mars Rover Perseverance Sent Most Incredible Footage of Mars",
        "description": "The most incredible panoramic views are shown in this video in 3 parts. First from spirit and the third vast view was captured by the perseverance rover from Crater Floor Fractured Rough unit in Jezero Crater, you can watch the scene with maximum details and in second part of the video you can see the most spectacular close-up view of geological interest, which was captured by the Curiosity rover.",
        "youTubeVideoId": "9pGE6WSjank",
        "duration": "00:08:44",
        "datePublished": "2025-01-11",
        "category": "Documentary"
    },
    {
        "title": "Enhancing the Ecosystem of Soudah Peaks",
        "description": "Soudah Peaks is a land of various wildlife, forests, and waterfalls, in contrast to the rest of its desert surroundings in Saudi Arabia. Discover the Soudah Development Project dedicated to preserving and enhancing this unique ecosystem.",
        "youTubeVideoId": "zkWbJxgQZm0",
        "duration": "00:04:39",
        "datePublished": "2025-01-06",
        "category": "Documentary"
    },
    {
        "title": "20 Coolest Tech at Consumer Electronics Show (CES) 2025",
        "description": "Our best CES 2025 tech list. From flying cars and sock-picking robots to groundbreaking VR glasses, CES 2025 brought the hottest tech.",
        "youTubeVideoId": "s4ET7Vn3nz4",
        "duration": "00:31:25",
        "datePublished": "2025-01-13",
        "category": "Science & Technology"
    },
    {
        "title": "Easy Air Fryer Cheesecake Recipe",
        "description": "This rich, creamy Air Fryer Cheesecake recipe is perfect for when cheesecake cravings hit, but you do not want to spend time fussing with a water bath. It is straightforward, delicious, and is yet another creative way to use an air fryer!",
        "youTubeVideoId": "dsu_IJjlTzk",
        "duration": "00:08:33",
        "datePublished": "2025-01-09",
        "category": "Howto & Style"
    },
    {
        "title": "How The British Took Over India",
        "description": "Trevor Noah is hilarious in describing how British took over India",
        "youTubeVideoId": "QhMO5SSmiaA",
        "duration": "00:05:50",
        "datePublished": "2021-02-27",
        "category": "Comedy"
    },
    {
        "title": "Decoding the Universe: Quantum",
        "description": "When we look at the world at the tiniest scales in the subatomic realm, things get weird – very weird. Welcome to the quantum universe, where particles can spin in two directions at once, observing something changes it, and something on one side of the galaxy can instantly affect something on the other, as if the space between them did not exist. Buckle up for a wild ride through the discoveries that proved all of this to be true and paved the way for the digital technologies we enjoy today – and the powerful quantum sensors and computers of tomorrow.",
        "youTubeVideoId": "t06aTX9jM34",
        "duration": "00:53:57",
        "datePublished": "2024-11-06",
        "category": "Documentary"
    },
    {
        "title": "Quantum Computers Explained: How Quantum Computing Works",
        "description": "Quantum computers use the principles of quantum mechanics to process information in ways that classical computers cannot. They rely on qubits, which can exist in multiple states simultaneously, allowing for more complex computations and parallel processing. Unlike classical bits, which are either 0 or 1, qubits can be in a state of 0, 1, or both simultaneously (superposition). This allows quantum computers to process a vast amount of information at once. Qubits can be entangled, meaning the state of one qubit can depend on the state of another, no matter how far apart they are. This correlation can be used to perform complex calculations more efficiently. Quantum computers could break widely used encryption methods (like RSA) due to their ability to factor large numbers quickly. This has led to the development of quantum-resistant encryption algorithms. They can simulate molecular interactions at a quantum level, significantly speeding up the drug discovery process by predicting how different compounds will behave. In this video, we have explained quantum computing in simple words and explained how quantum computers work.",
        "youTubeVideoId": "B3U1NDUiwSA",
        "duration": "00:05:40",
        "datePublished": "2024-09-23",
        "category": "Education"
    },
    {
        "title": "Top 20 New Technology Trends that will Define the Future",
        "description": "Are you ready to see what the future holds? In this video, we unveil the top 20 new technology trends that are shaping the world of tomorrow. These cutting-edge innovations are not just concepts—they are transforming industries, redefining lifestyles, and paving the way for a smarter, more connected future.",
        "youTubeVideoId": "KvN3JXICzdM",
        "duration": "00:13:21",
        "datePublished": "2024-11-27",
        "category": "Education"
    },
    {
        "title": "Ancient Civilizations of the World: Drain the Oceans",
        "description": "National Geographic is the premium destination for science, exploration, and adventure. Through their world-class scientists, photographers, journalists, and filmmakers, Nat Geo gets you closer to the stories that matter and past the edge of what is possible.",
        "youTubeVideoId": "Dpu3XoY3wQw",
        "duration": "04:36:14",
        "datePublished": "2025-01-11",
        "category": "Documentary"
    },
    {
        "title": "50 Best Places to Visit in 2025 | Travel Guide",
        "description": "These are the 50 best places to visit in the world. With over 1 billion people traveling every single year, there are so many beautiful destinations to travel around the world each filled with their traditions, arts, music, and customs. Whether it is serene beaches, big cities, remote islands, or historic landmarks, there is so much to uncover that the world has to offer.",
        "youTubeVideoId": "6eE4pSUDa9k",
        "duration": "00:57:04",
        "datePublished": "2024-02-09",
        "category": "Travel & Events"
    },
    {
        "title": "10 Tips for Effective Time-Management",
        "description": "The video provides essential tips to manage your time effectively.",
        "youTubeVideoId": "J815fTmr9qE",
        "duration": "00:11:13",
        "datePublished": "2025-01-04",
        "category": "Education"
    },
    {
        "title": "City of the Future: Singapore – Full Episode | National Geographic",
        "description": "With visionary thinkers and innovators as the guides, City of the Future: Singapore dives deep into the latest innovations and technology being created and implemented to blaze a path into the future.",
        "youTubeVideoId": "xi6r3hZe5Tg",
        "duration": "00:44:24",
        "datePublished": "2018-11-24",
        "category": "Documentary"
    },
    {
        "title": "AI and the Fifth Industrial Revolution: Our World in 2074",
        "description": "The video provides an overview of past industrial revolutions and speculates about the future, highlighting how AI will transform industries, create new challenges like job displacement, and potentially alter human civilization. It discusses both optimistic and dystopian futures, including the development of artificial superintelligence, genetic manipulation, and human-robot symbiosis. The video emphasizes the importance of resolving ethical and cultural challenges to ensure a positive future, where AI benefits all of humanity rather than a select few.",
        "youTubeVideoId": "MaEf17Fxieo",
        "duration": "00:26:55",
        "datePublished": "2024-09-15",
        "category": "People & Blogs"
    },
    {
        "title": "NFL Hilarious Moments of the 2024 Season!",
        "description": "The video shows hilarious moments of the 2024 NFL season",
        "youTubeVideoId": "ojyvJAW4uuk",
        "duration": "00:11:13",
        "datePublished": "2025-01-12",
        "category": "Sports"
    },
    {
        "title": "20 Most Beautiful Buildings that Took Creativity at Another Level",
        "description": "Have you ever seen a building so unique it looks like a piece of art or a futuristic design straight out of a sci-fi movie? In this episode, we reveal 20 of the most unique and quirky buildings around the world.",
        "youTubeVideoId": "YYC1gBqkgr0",
        "duration": "00:21:15",
        "datePublished": "2025-01-02",
        "category": "Science & Technology"
    },
    {
        "title": "The Origins of Space-Time Explained: The Fabric of Reality",
        "description": "In this captivating documentary, we unravel the enigma of space-time, beginning with the explosive moment of the Big Bang and exploring how this cosmic tapestry shapes everything we know. Discover how gravity, as revealed by Albert Einstein, warps space-time, guiding celestial bodies through the cosmos. We will also delve into the Cosmic Microwave Background and the influence of dark energy on our expanding universe.",
        "youTubeVideoId": "vjIzMa1WcGg",
        "duration": "00:03:33",
        "datePublished": "2025-01-11",
        "category": "Documentary"
    },
    {
        "title": "The Evolution of AI: 1950 to Now",
        "description": "Discover how AI transformed from a theoretical concept in the 1950s, sparked by pioneers like Alan Turing, to the revolutionary technologies shaping our everyday lives today.",
        "youTubeVideoId": "Qwx-wKA7Nb8",
        "duration": "00:10:10",
        "datePublished": "2025-01-06",
        "category": "Education"
    },
    {
        "title": "Scams of 2024 and What is Coming in 2025",
        "description": "Before you fall victim to the next big scam, watch this video to arm yourself with the knowledge you need to stay one step ahead!",
        "youTubeVideoId": "RIzBotzMEJo",
        "duration": "00:10:20",
        "datePublished": "2024-10-20",
        "category": "Education"
    },
    {
        "title": "Experience the 10 Best National Parks to Visit in 2025 | Travel Guide",
        "description": "Discover the top 10 national parks to visit in 2025, featuring stunning landscapes, unique wildlife, and thrilling adventures. From the iconic Yellowstone in the USA to the surreal beauty of Madagascar's parks, this video will inspire your next travel destination.",
        "youTubeVideoId": "T20K80zb6_o",
        "duration": "00:06:18",
        "datePublished": "2025-01-13",
        "category": "Travel & Events"
    },
    {
        "title": "Cybersecurity Trends for 2025 and Beyond",
        "description": "In the ever changing landscape cybersecurity landscape, Jeff Crume reviews his predictions for last year and peers into his crystal ball to see what may be coming in 2025 and beyond especially when it comes to how AI will change the threat landscape to possible solutions.",
        "youTubeVideoId": "kqaMIFEz15s",
        "duration": "00:16:54",
        "datePublished": "2024-12-30",
        "category": "Education"
    },
    {
        "title": "Master Time Management Skills Like a Pro in 2025!",
        "description": "Unlock the secrets to effective time management. In just 8-9 minutes, discover actionable tips and relatable life hacks that will transform how you plan your day and boost your productivity. Learn essential techniques such as goal setting, prioritization, and effective scheduling to help you reclaim your time and achieve your aspirations. Whether you are focused on self-improvement as a student, professional, or entrepreneur, these expert insights will empower you to take control of your schedule like never before.",
        "youTubeVideoId": "Msz0Rab3Ff0",
        "duration": "00:08:15",
        "datePublished": "2024-12-24",
        "category": "Education"
    },
    {
        "title": "Parkinson's Law: How to Manage Your Time More Effectively",
        "description": "Once you understand Parkinson's Law, it is easy to apply its principles to your own projects, essays, presentations, goals, and more. Play with reassigning deadlines, breaking up your projects and goals into smaller parts, and challenging yourself to get things done faster than you expect.",
        "youTubeVideoId": "nnIimOTcsAs",
        "duration": "00:07:05",
        "datePublished": "2021-12-19",
        "category": "Education"
    }
]
